Revit 2024 API
BuiltInFailures.RevisionCloudFailures.ProhibitCreationInIssued Property
 The most current project revision has been issued. No new revision clouds can be created in it. Please add a new revision to the global revision table.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ProhibitCreationInIssued { get; }
Visual Basic
Public Shared ReadOnly Property ProhibitCreationInIssued As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ProhibitCreationInIssued {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RevisionCloudFailures Class
Autodesk.Revit.DB Namespace